#                            რა არის კომენტარები Python-ში?

# Python-ში კომენტარები იწყყება სიმბოლოთი #. კომენტარები გამოიყენება კოდის ახსნისთვის
# ან შენიშვნის დასაწერად. კომენტარები არ აღიქმნება პროგრამის მიერ და არ ახდენს გავლენას
# კოდის შესრულებაზე. კომენტარები მნიშვნელოვანია კოდის აღწერისთვის და დეტალური განხილვისთვის

# მაგალითად: თუ თქვენ გაქვთ რთული კოდი და გინდათ რომ არეულად არ იყოს და იცოდეთ 
# თუ როდის და რატომ გამოიყენნეთ კონკრეტული ფუნქცია, შეგიძლიათ გამოიყენოთ კომენტარები.
# აი ასე მაგალითად:

# lets draw square whith libraly "turtle"
from turtle import * #rom turtle import * actually we active all the functions of turtle libraly (ქართულადაც შეიძლება მაგრამ ჩვენ ხომ პროები ვართ და უნდა ვისწავლოთ ინგლისური)  :)
forward(100)
right(90)  # this function darw spuare whith size 100 
forward (100)
right(90)
forward(100)
right(90)
forward (100)   # this function darw square whith size 100 
exitonclick()          # ncthis fution exits from the program when we click on the screen
# done thank you for wathing my code

# ეს იყო და ეს. ახლა ყველაფერი რაც # სიმბოლითი იწყება პაითონი ვერ ხედავს და ზუსტად ესაა კომენტარის ფუნქცია.
#--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#                            რა შეუძლია Python-ს მათემატიკაში

# მოკლედ რომ ვთქვათ ამ პროგრამულ ენას შეუძლი თითქმის ყველა არითმეტიკული ოპერაციეა
# კერძოდ კი დამატება გამოკლება ფესვის ამოღება გამრავლება გაყოფა და სხვა მრავალი.
# მოდით კოდის სახით ჩავწეროთ:

print(5+5) # this function shows the result of 5+5
print(10-5) # this function shows the result of 10-5
print(5*5) # this function shows the result of 5*5
print(10/5) # this function shows the result of 10/5
print(5**2) # this function shows the result of 5**2 or for georgians 5^2 (5-ის კვადრატი) :)

# ასევე მინდა ვთქვა რომ პრინტ ფუნქცია უბრალოდ გამოაქვს რიცხვები ტერმინალში საჩვენებლად თორემ
# აუცილებელია არაა მისი გამოყენება. პროგრამა მაინც შეასრულებს მის დავალებას. ეს ახლა რომ დავინახოთ შედეგი

# თავიდანვე კოდები იმისთვის შეიქმნა რომ ადამიანებს შეესრულებინათ რტული მათემატიკური ოპერაციები.
# ეს კოდები მუშაობდა სულ პირველ პროგრამულ ენებში. თუმცა Python-ს შეუძლია ბევრად მეტი მათემატიკური ოპერაციების შესრულება.
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#                           რა არის integer და string Python-ში?

# მარტივად რომ ავხსნათ string არის ყველაფერი ის რაც " " რაც ბრჭყალებშია ჩასმული.
# თუნდაც ეს იყოს ციფრი ან ნებისმიერი სხვა რა  ყველაფერი რაც ბრჭყალებში პროგრამა უბრალოდ ხედავს სიმბოლოებს.

# integer არის მთელი რიცხვი. integer შეიძლება იყოს დადებითი ან უარყოფითი. integer არ არის ბრჭყალებში ჩასმული.
# მასზე ჩვეულებრივ შიძლება არითმეტიკული ოპერაციების შესრულება. integer შეიძლება იყოს ნებისმიერი მთელი რიცხვი. მაგალითად: 1, 2, 3, 4, 5, -1, -2, -3, -4, -5,

# შენიშვნა! integer ვერ იქნება ასოები ის მხოლოდ მთელი რიცხვებია ხოლო string შეიძლება იყოს ნებისმიერი სიმბოლოები. მაგალითად: "hello", "world", "123", "abc", "!" და ა.შ.

#მაგალითად:
print("hello world") # this function shows the string "hello world"
print(5) # this function shows the integer 5
print("5") # this function shows the string "5"

# შენიშვნა2! Int (+, -, *, /, **) str ვერ იმუშავებს რადგანაც ისინი განსხვავებულ ტიპის მონაცემებია. მაგალითად:
# print(5 + "5") # this function shows the error because Int and str can't work 

# ასევე მინდა ვთქვა რომ Python-ს შეუძლია string-ების გაერთიანება. მაგალითად:
print("hello" + " " + "world") # this function shows the string "hello world" because we use + to combine the strings
# მაგრამ რათქმოუნდა სიმბოლოებს ვერ გავყოფთ ან ფესვს ამოვიღებთ და გამოვაკლებთ ისე ეს რათქმოუნდა ლოგიკურია. მაგრამ შეგვიძლია გამრავლება. მაგითად
print("heloo " * 3)
#---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#                            რა არის ცვლადები Python-ში?
# ჩვენ ვიცით რომ კომპიუტერი ვერ ფიქრობს და ვერ ახდენს რაიმე ლოგიკურ ოპერაციას. ამიტომაც ჩვენ უნდა ვუთხრათ მას რა უნდა გააკეთოს.
# ჩვენ კი ვეტყვით ინგლისურად მაგრამ მან უნდა გადათარგმნოს 0 და 1-ში. Python კი ხაზი-ხაზ მიუყვება და ისე თარგმინს და ასრულებს
# ოპერაციას. ამიტომ როცა ის შემდეგ ხაზზე მიდის ის ვერ ახსოვს რა გააკეთა წინა ხაზზე. ამიტომაც ჩვენ უნდა შევქმნათ ცვლადები. 
# ცვლადი არის ერთგვარი კონტეინერი რომელიც ინახავს მონაცემს. ეს მონაცემი კი, პაითონს  ახსოვს და როცა დასჭირდება ის მარტივად მიხდება თუ რას ვეუბნებით. მაგალითად:

X = 5 # this function creates a variable X and assigns the value 5 to it
Y = 10 # this function creates a variable Y and assigns the value 10 to it
Z = 15 # this function creates a variable Z and assigns the value 15 to it

# აი შევქმენით სამი კონტეინერი (ცვლადი) X, Y და Z. პაითონმა დაინახა რომ შეიქმნა ცვლედები და დაიმახსოვრა ისინი. კარგი გვეყო ამდენი ლაი ლაი გავაგრძელოთ.

print(15+5) # < წაიკითხა გადათარგმნა შეასრულა
print("aleqsandre Shainidze") # < წაიკითხა გადათარგმნა შესრულა
print(X+Y+Z) # < წაიკითხა და სტოპ სტოპ სტოპ ვეით ეს რა არის იკითხავს პროგრრამა

# დიახ როცა მან დაინახა ეს სიმბოლოები და მიხდა არც ინტენჯერია არც სტრინგი და არც შეცდომა 
# ის დაიწყებს ზემოთ კოდების გადახედვას და იპოვის ამ ცვლადების მნიშვნელობას. ამიტომაც საკმაოდ სასრგებლო ფუნქცია ცვლადები

# ცოტა ბევრი მაგალითი
print("------------------------------------------------------------") # this is border :)

name = "aleqsandre"
lastname = "shainidze" 
age = "15 wlis"

print(name +" " + lastname+ " " + age) # ეს გასაგებია 

# მოდი ახლა ცოტა მათემატიკა

ricxvi1 = 230421
ricxvi2 = 2132134
jami = ricxvi1 + ricxvi2
sxvaoba = ricxvi1 - ricxvi2
namravli = ricxvi1 * ricxvi2
ganayofi = ricxvi1 / ricxvi2

# მოდი ეს რიცხვები შევკრიბოთ გამოვაკლოთ გავამრავლოთ გავყოთ.

print(jami)
print(sxvaoba)
print(namravli)
print(ganayofi)

# მე ვფიქრობ ტერმინალმა ყველაფერი უკვე აჩვენა
print(f"ricxvi1s da ricxvi2is jami aris {jami} xolo sxvaoba {sxvaoba}")

#