
სახელი = input("შეიყვანე სახელი: ")

print("============================================================")

გვარი = input("შეიყვანე გვარი:")

print("============================================================")

ასაკი = input("შეიყვანე გვარი:")

#წინადადება ნომერი 1
print(f"გამარჯობა მე ვარ {სახელი} {გვარი}, {ასაკი} წლის. ")


print("============================================================")

ფერი = input("შეიყვანე საყვარელი ფერი:")

#წინადადება ნომერი 2
print(f"მე ვარ ანა და ჩემი საყვარელი ფერია {ფერი}.")


print("============================================================")

საკვები = input("შეიყვანე საყვარელი საკვები:")

#წინადადება ნომერი 3
print(f"მე ვარ {სახელი} და ძალიან მიყვარს {საკვები}.")


print("============================================================")

ქალაქი = input("შეიყვანე ქალაქი:")

#წინადადება ნომერი 4
print(f"მე მქვია {სახელი} და ვცხოვრობ {ქალაქი}")


print("============================================================")

ჰობი = input("შეიყვანე შენი ჰობი:")


#წინადადება ნომერი 5
print(f"მე მქვია {სახელი} და ჩემი ჰობია {ჰობი}")


print("============================================================")

მეგობარი = input("შეიყვანე მეგობრის სახელი:")
ასაკი2 = input("შეიყვანე შენი მეგობრის ასაკი:")

#წინადადება ნომერი 6
print(f"ჩემი მეგობარია {მეგობარი} და მისი ასაკია {ასაკი2} ხოლო ჩემი სახელია {სახელი} ასაკი კი {ასაკი}")


print("============================================================")

ფილმი = input("შეიყვანე შენი საყვარელი ფილმი:")
ჟანრი = input("შეიყვანე შენი საყვარელი ფილმის ჟანრი:")

#წინადადება ნომერი 7
print(f"ჩემი საყვარელი ფილმია {ფილმი} ხოლო მისი ჟანრია {ჟანრი}")


print("============================================================")

სპორტი = input("შეიყვანე შენი საყვარელი სპორტის სახეობა:")
სპორტსმენი = input("შეიყვანე შენი საყვარელი სპორტსმენი:")

#წინადადება ნომერი 8
print(f"ჩემი საყვარელი სპორტის სახეობაა {სპორტი} ხოლო სპორტსმენი {სპორტსმენი}")


print("============================================================")


პროდუქტი = input("შეიყვანე პროდუქტის სახელწოდება:")
ფასი = int(input("შეიყვანე ამ პროდუქტის ფასი მთელი რიცხვებით:"))
რაოდენობა = int(input("შეიყვანე ამ პროდუქტის რაოდენობა:"))
საბოლოო = ფასი * რაოდენობა


#წინადადება ნომერი 9
print(f"პროდუქტი {პროდუქტი} ხოლო მისი ფასია {ფასი} და მე მინდა ვიყიდო {რაოდენობა} გადასახდელი მექნება {საბოლოო} ლარი")


print("============================================================")

print("შეიყვანე ქვეყანა, ქალაქი და მოგზაურობის დღეების რაოდენობა ცალკ-ცალკე ააუცილებლად")
ქვეყანა = input("შეიყვანე ქვეყანა სადაც გინდა მოგზაურობა:")
ქალაქი2 = input("შეიყვანე ამ ქვეყნის ქალაქი სადაც გინდა იმოგზაურო:")
დღეები = input("შეიყვანე რამდენი დღე გინდა იმოგზაურო")


#წინადადება ნომერი 10
print(f"მე მქვია {სახელი} მინდა ვიმოგზაურო {ქვეყანა}ში კერრძოდ კი ქალაქ {ქალაქი2}ში დაახლოებით {დღეები} დღე")

print("============================================================")

#მადლობა ყურადღებბისათვის