print("შეიყვანე სახელი")
სახელი = input()

print("============================================================")

print("შეიყვანე გვარი")
გვარი = input()

print("============================================================")

print("შეიყვანე ასაკი")
ასაკი = input()


#წინადადება ნომერი 1
print(f"გამარჯობა მე ვარ {სახელი} {გვარი}, {ასაკი} წლის. ")


print("============================================================")

print("შეიყვანე საყვარელი ფერი")
ფერი = input()


#წინადადება ნომერი 2
print(f"მე ვარ ანა და ჩემი საყვარელი ფერია {ფერი}.")


print("============================================================")

print("შეიყვანე საყვარელი საჭმელი")
საკვები = input()

#წინადადება ნომერი 3
print(f"მე ვარ {სახელი} და ძალიან მიყვარს {საკვები}.")


print("============================================================")


print("შეიყვანე შენი საცხოვრებელი ადგილი")
ქალაქი = input()


#წინადადება ნომერი 4
print(f"მე მქვია {სახელი} და ვცხოვრობ {ქალაქი}")


print("============================================================")

print("შეიყვანე შენი ჰობი")
ჰობი = input()


#წინადადება ნომერი 5
print(f"მე მქვია {სახელი} და ჩემი ჰობია {ჰობი}")


print("============================================================")

print("შეიყვანე შენი საყვარელი მეგობრის სახელი და ასაკი ცალკ-ცალკე აუცილებლად")
მეგობარი = input()
ასაკი2 = input()


#წინადადება ნომერი 6
print(f"ჩემი მეგობარია {მეგობარი} და მისი ასაკია {ასაკი2} ხოლო ჩემი სახელია {სახელი} ასაკი კი {ასაკი}")


print("============================================================")

print("შეიყვანე შენი საყვარელი ფილმი და მისი ჟანრი ცალკ-ცალკე აუცილებლად")
ფილმი = input()
ჟანრი = input()


#წინადადება ნომერი 7
print(f"ჩემი საყვარელი ფილმია {ფილმი} ხოლო მისი ჟანრია {ჟანრი}")


print("============================================================")

print("შეიყვანე შენი საყვარელი სპორტის სახელი და საყვარელი სპოტსმენი ცალკ-ცალკე აუცილებლად")
სპორტი = input()
სპორტსმენი = input()


#წინადადება ნომერი 8
print(f"ჩემი საყვარელი სპორტის სახეობაა {სპორტი} ხოლო სპორტსმენი {სპორტსმენი}")


print("============================================================")

print("შეიყვანე პროდუქტი, ფასი და რაოდენობა ცალკ-ცალკე აუცილებლად")
პროდუქტი = input()
ფასი = (input())
რაოდენობა = (input())


#წინადადება ნომერი 9
print(f"პროდუქტი {პროდუქტი} ხოლო მისი ფასია {ფასი} და მე მინდა ვიყიდო {რაოდენობა}") 


print("============================================================")

print("შეიყვანე ქვეყანა, ქალაქი და მოგზაურობის დღეების რაოდენობა ცალკ-ცალკე ააუცილებლად")
ქვეყანა = input()
ქალაქი2 = input()
დღეები = input()


#წინადადება ნომერი 10
print(f"მე მქვია {სახელი} მინდა ვიმოგზაურო {ქვეყანა}ში კერრძოდ კი ქალაქ {ქალაქი2}ში დაახლოებით {დღეები} დღე")

print("============================================================")

#მადლობა ყურადღებბისათვის


#