რიცხვი1 = int(input("შეიყვანე რიცხვი 1:"))
რიცხვი2 = int(input("შეიყვანე რცხვი 2:"))
მოქმედება = input("აარჩიე მოქმედება + ან -:")
if მოქმედება == "+":
	print(რიცხვი1+რიცხვი2)
elif მოქმედება == "-":
	print(რიცხვი1-რიცხვი2)

#=======================================================================================

სახელი = input("შეიყვანე სახელი და გვარი: ")
print(სახელი[0]+"." + სახელი[11]+".")

#=======================================================================================

კოდი = input("შექმენი ნებისმიერი კოდური სიტყვა: ")
print(კოდი[0:3] + კოდი[-1:-3])