# LEVEL 01
# Software და Hardware 
# რა განსხვავებაა მათ შორის და რაში გვჭირდება ისინი

# Software - არის ყველაფერი ის რაც თვითონ კომპიუტერის შიგნით სისტემაში მუშაობს. Software არის  პროგრამები რომლებსაც უშვებს კომპიუტერი. ამ პროგრამებს ქმნის პროგრამისტი ან პროგრამისტთა ჯგუფი (Mojang, Microsoft, და სხვა)
# Hardware - არის კომპიუტერის შიდა ფიზიკური სამყარო. ყველაფერი ის რაც კომპიუტერს სჭირდება მუშაობაში და რაც ფიზიკურად არსებობს. ( CPU, GPU, RAM, ეკრანი მაუსი და სხვები) თითოეული მათგანი საჭიროა კომპიუტერის გამართული მუშაობისათვის. ამ ყველა ნაწილს ქმნიან ინჟინერები ან კიდევ მათი ჯგუფი ( NVIDAI, AMD, Intel და სხვები ) 

# ეს ორივე ერთმანეთთან მჭიდროდაა დაკავშირებული რადგან თუ არ იქნებოდა პროგრამები რომლებიც უნდა გაუშვას Hardware-ს  მაშინ თვითონ კი უსარგებლო გამოდის ხოლო Software რათქმოუნდა ვერ იმუშავებდა კომპიუტერის შიდა ნაწილების გარეშე 
# მაგალითი: Minecraft არის პროგრამა რომელიც უნდა გაეშვას კომპიუტერი ხოლო ვიდეო ბარათი (GPU) არის გრაფიკებზე პასუხის მგებელი Hardware ინსტრუმენტი. თუ ერთ-ერთი მათგანი არ იმუშავებს არც არაფერი გამოვა.

# როგორ მუშაობს კომპიუტერი

# რათა გავარკვიოთ როგორ მუშაობს კომპიუტერი საჭიროა ვიცოდეთ თუ რას იყენებს ამისათვის. კომპიუტერი მუშაობისათვის ზემოთ ნახსენებ Hardware ნაწილები სჭირდება. კონკრეტულად კი
# •	CPU ( პროცესორი ) - პროცესორი არის კომპიუტერის ტვინი რომელიც ადამიანის ყველა ბრძანებას ასრულებს. როგორ ამაზე ქვემოთ ვისაუბრებთ.
# •	GPU ( ვიდეო ბარათი ) - პასუხისმგებელია გრაფიკებზე და FPS-ზე
# •	RAM - არის დროებითი საცავი რომელიც იმ ადგილას იმ მომენტში ინახავს საჭირო ინფორმაციას ხოლო კომპიუტერის გათიშვის მერე ქრება
# •	დედაპლატა (Motherboard) - არის ერთი დიდი დაფა რომელიც ზემოთ ჩამოთვლილ და კიდევ სხვა მოწყობილობებს ერთმანეთთან აკავშირებს.

# ესენია ერთ-ერთი ყველაზე მთავარი მოწყობილობები კომპიუტერში. აქ რათქმოუნდა არაა უმთავრესი ნაწილი და ერთი მათგანის გარეშეც კომპიუტერი ვერ იმუშავებდა მაგრამ ზემოთ ნახსენებია პროცესორი როგორც ტვინი. ის ხომ ადამიანურად ვერ ფიქრობს და არც მათი ენა ესმის მაშინ როგორ ასრულებს ადამიანის ბრძანებებს და როგორ ესმის მისი? საინტერესოა მოდი ეს ცალკე განვიხილოთ.

# /

# ორობითი სისტემა

# პროცესორს აქვს თავისი ,,ენა“ რომელსაც ორობითი ენა ეწოდება. ჩვენ ყოველდღიურ სისტემაში ვიყენებთ ათობით სისტემას რაც საკმაოდ მარტივია. 1, 2, 3, 4, 5, 6, 7, 8, 9 ესენი და ვსო. თითქოს ყველაზე მარტივი 10 ციფრი 10 სიმბოლო სხვადასხვა ნაირი. ამიტომაცაა ათობითი მაგრამ მაშინ რა არის ორობით. აქ ზუსტად იგივე სისტემა მგრამ გვაქ მხოლოდ 0 და 1. ვსო ახლა ამით უნდა ავაწყოთ ყველაფერი. 
# 1 – 1
# 0 – 0
# 10 – 2
# 11 – 3
#  და ასე შემდეგ. როცა ციფრები გველევა უბრალოდ წინ ემატება ახალი რიგი. ასე მოქმედებს კომპიუტერის მეხსიერება. წარმოვიდგინოთ რომ თქვენი ტვინი ოთახს ნულებით და ერთებით აღწერს. 
# აი ლოგინი მაგალითად 011100101 კარადა სხვანაირად ად ასე შემდეგ. კომპიუტერის მეხსიერება მაგრამ ტვინისგან განსხვავებით ტვინი თავისით სუფთავდება და არასაჭირო ინფორმაციას ივიწყებს ხოლო პროცესორს ასეთი ფუნქცია არ აქვს. მარტივად რომ ვთქვათ მეხსიერება არის ის თუ რამდენი 0 და 1-ს დათვლა შეუძლია კომპიუტერს და შენახვა. ინფორმაცია იზომება ბიტებში და ბაიტებში ( მეგაბიტი, გიგაბაიტი, ტერაბაიტი, ).


# High-level and Low-level პროგრამირების ენები

# მოდით განვიხილოთ რამდენად რთულია ორობითი სიტემით პროგრამის და კოდის დაწერა. მაგრამ დამეთანხმებით ეს ძალიან გრძელი და მოსაწყენია მხოლოდ 0-ის და 1-ის წერა. წარმოიდგინეთ რომ დავწეროთ გამარჯობა ორობითი სიტემით იქნება ასე : 
# 11100001 10000011 10010010 11100001 10000001 10000000 11100001 10000011 10010111 11100001 10000001 10000000 11100001 10000011 10011001 11100001 10000011 10101011 11100001 10000011 10101111 11100001 10000001 10001001 11100001 10000001 10000000. რთულია ხომ? ადამიანებმა ზუსტად ასე იფიქრეს და გადაწყვიტეს რომ პროცესორს თავისი ენით დალაპარაკებოდნენ ხოლო მას თვითონ გადაეთარგმნა ყველაფერი ორობით სიტემაში და მერე შეესრულებინა ბრძანება. მაგრამ ყველა ენა ხომ ერთნაირი არაა. 
# მართალი ხართ მაგალითად პითონის კოდი რომ დაწეროთ უნდა იცოდეთ ინგლისური და კოდის აგებულება. და ვსო. მაგრამ რომ დავწეროთ Machine Language-ით ეს გაცილებით რთულია. ასე გაჩნდა LOW-level and HIGH-level ენები. აქ ძალიან მარტივია დაბალი ანუ ინგლისურთან და ადამიანურთან ახლოს ხოლო მაღალი ორობით სისტემასთან და მექანიკურ ენასთან ახლოს.

